# ── Taps ──────────────────────────────────────────────────────────────────────
tap "gromgit/brewtils"
tap "oven-sh/bun"
tap "teamookla/speedtest"

# ── Formulae ──────────────────────────────────────────────────────────────────

# Core Dependencies
brew "openssl@3"

# Shell / Terminal
brew "fish"
brew "starship"
brew "stow"
brew "fzf"
brew "ripgrep"
brew "eza"
brew "yazi"
brew "macchina"

# Editors / Git
brew "neovim"
brew "git"
brew "lazygit"
brew "lazydocker"

# Version Managers
brew "mise"
# Languages / Runtimes
brew "bun"

# Python Tooling
brew "uv"
brew "jupyterlab"

# Cloud / DevOps
brew "awscli"

# Containers
brew "docker"
brew "colima"
brew "lima"

# Databases
brew "pgcli"

# Build Tools
brew "make"
brew "gcc"
brew "cocoapods"

# HTTP / Network
brew "httpie"
brew "hurl"
brew "speedtest"

# Utilities
brew "taproom"

# ── Casks ─────────────────────────────────────────────────────────────────────

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Apps
cask "claude"
cask "claude-code"
cask "drawio"
cask "ghostty"
cask "rio"
cask "wezterm"
cask "zed"

# Java
cask "zulu@8"
