# ── Core Dependencies ─────────────────────────────────────────────────────────
brew "openssl@3"

# ── Shell / Terminal ──────────────────────────────────────────────────────────
brew "fish"
brew "starship"
brew "stow"
brew "fzf"
brew "ripgrep"
brew "eza"           # modern ls replacement
brew "yazi"          # terminal file manager
brew "macchina"      # system info

# ── Editors / Git ─────────────────────────────────────────────────────────────
brew "neovim"
brew "git"
brew "lazygit"
brew "lazydocker"

# ── Version Managers ──────────────────────────────────────────────────────────
brew "mise"
brew "fnm"

# ── Languages / Runtimes ──────────────────────────────────────────────────────
brew "bun"

# ── Python Tooling ────────────────────────────────────────────────────────────
brew "uv"
brew "jupyterlab"

# ── Cloud / DevOps ────────────────────────────────────────────────────────────
brew "awscli"

# ── Containers ────────────────────────────────────────────────────────────────
brew "docker"
brew "docker-compose"
brew "colima"
brew "lima"

# ── Databases ─────────────────────────────────────────────────────────────────
brew "pgcli"

# ── Build Tools ───────────────────────────────────────────────────────────────
brew "make"
brew "gcc"
brew "cocoapods"

# ── HTTP / Network ────────────────────────────────────────────────────────────
brew "httpie"
brew "hurl"
brew "speedtest"

# ── Utilities ─────────────────────────────────────────────────────────────────
brew "ical-buddy"
brew "taproom"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "wezterm"
cask "drawio"
