aaron-bond.better-comments
anthropic.claude-code
biomejs.biome
charliermarsh.ruff
enkia.tokyo-night
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
pranaygp.vscode-css-peek
rust-lang.rust-analyzer
sdras.night-owl
shd101wyy.markdown-preview-enhanced
sumneko.lua
tamasfe.even-better-toml
usernamehw.errorlens
